package javabasic;

// 패키지란?
// 패키지는 마치 파일 시스템의 폴더(디렉토리)와 비슷합니다
// src 우클릭 > new > pakage > name : c02

// 자바 프로그램을 개발하기 위해서는
// 우선 파일 확장명이 .java인 텍스트 파일을 생성하고
// 자바 언어로 코드를 작성해야 합니다.
// 이렇게 만들어진 자바 소스 파일을 컴파일러가(javac)가 컴파일합니다
// 컴파일은 CPU에서 실행 될 수 있는 언어로 변환 되는 것이다.

//프로그램 소스 분석
//소스 파일을 보면 최상단에 package 키워드와 패키지 이름이
//명시되어 있습니다
//패키지 선언이 되어 있어야합니다

//키워드(keyword) 예약어
//예약되어 있는 단어
//이클립스에서는 키워드는 자주색으로 나온다 다크모드는 주황색

// 클래스 선언입니다
// ()- 소괄호 , {}- 중괄호, []- 대괄호
// 중괄호 {} 블록의 앞부분인 public class ClassName을
// 클래스 선언부라고 합니다.
// public class는 공개 클래스라는 뜻이고,
// C01_03은 클래스 이를입니다.
// 클래스 이름은 소스 파일명과 동일해야 하며, 대소문자도 일치해야 한다


public class C01_03 {
	// 언어를 배우는 동안에는 문법을 잘 알아서
	// 컴파일 에러를 빨리 해결하는 것이 최우선 목표다
	
	//자바 코드가 실행하려면 클래스 블록 내부에 다음과같은
	//main()메소드(함수) 블록을 가지고 있어야 합니다.
	//컴파일러가 가장 먼저 하는 일은 실행된 class문서에서
	//main() 메소드를 찾아 실행 한다
	//main() 메소드를 프로그램 실행 진입점이라고 봅니다.
	public static void main(String[] args) {
		System.out.println("Hello, Java01");
		
	}
}
