package javabasic;

//주석 사용하기
// 주석은 프로그램 실행과는 상관없이 코드에 설명을 붙인 것을 말한다
//복잡한 코드일수록 주석을 달면
//전체 코드를 이해하기 쉽고 수정이 용이 합니다
//특히 다른 사람이 작성한 코드를 주석 없이 해석하는
//작업은 쉬운 일이 아니기 ㄸ문에
//본인이 작성한 코드를 다른사람이 볼 필요가 있다면
//주석을 꼭 넝어주는 것이 좋습니다

//주석은 컴파일 과정에서 무시된다.
//따라서 주석을 많이 작성한다고 해서 파일의 크기가 커지는 것은 아니므로
//가급적이면 설명이 필요한 코드에 주석을 달아두는것이 좋다

//주석 기호
// 구분 /주석기호/설명
//라인 주석(한줄 주석)/ //... / // 부터 라인 끝까지 주석으로 처리합니다.
//범위 주석(여러줄 주석)/ /* */ / /*와 */ 사이에 있는 내용은 모두
//주석으로 처리합니다.
/* 여러줄주석
 * 한줄
 * 두줄
 세줄
 */
/*
 작성자: 배
 작성일: 2024-09-24
 */
public class C01_03_01 {
	// 프로그램 실행 진입점
	// main() 메소드
	public static void main(String[] args){
		//콘솔에 hello등의 문자를 출력한다
		System.out.println("Hellon, Java02");
	}
}
